Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: If the sequence has no elements, returns nil.
ja: シーケンスが要素を持たないならば、nilを返します。

source: If the sequence has no elements, the result is initialResult.
ja: シーケンスが１つも要素を持たないならば、結果はinitialResultです。

source: If the sequence is empty, this method returns true.
ja: シーケンスが空ならば、このメソッドはtrueを返します。

source: If the string is empty, startIndex is equal to endIndex.
ja: 文字列が空ならば、startIndexはendIndexと等しいです。

source: If the system cannot provide an appropriate priority, returns Priority.default.
ja: システムが適切な優先度を提供できないならば、Priority.defaultを返します。

source: If the task gets cancelled internally – for example, by checking for cancellation and throwing a specific error, or by calling checkCancellation(), then the error thrown by the task is rethrown here.
ja: タスクが内部的に取り消されるならば – 例えば、取り消しを調べるそして特定のエラーをスローすることによって、またはcheckCancellation()を呼び出すことによって、そのときタスクによってスローされるエラーはここで再スローされます。

source: If the task gets cancelled internally – for example, by checking for cancellation and throwing a specific error, or by calling checkCancellation(), then the error thrown by the task is returned here.
ja: タスクが内部的に取り消されるならば – 例えば、取り消しを調べるそして特定のエラーをスローすることによって、またはcheckCancellation()を呼び出すことによって、そのときタスクによってスローされるエラーはここで返されます。

source: If the task has not completed yet, its priority will be elevated to the priority of the current task.
ja: タスクがまだ完了しないならば、それの優先度は現在のタスクの優先度まで昇進させられるでしょう。

source: If the task hasn’t completed, its priority increases to that of the current task.
ja: タスクが完了していないならば、それの優先度は現在のタスクのものまで増大します。

source: If the task is cancelled, throws \c CancellationError without waiting for the duration.
ja: タスクが取り消されるならば、CancellationErrorエラーをその期間を待つことなくスローします。

source: If the task that’s currently running this group is canceled, the group is also implicitly canceled, which is also reflected in this property’s value.
ja: 現在このグループを実行しているタスクが取り消されるならば、そのグループもまた暗黙的に取り消されます、それはまたこのプロパティの持つ値に反映されます。

source: If the value is a reference type, it will be retained for the duration of the operation closure.
ja: 値が参照型であるならば、それは演算クロージャの持続期間に対して保持されるでしょう。

source: If the value is not null, does not increment currentIndex.
ja: 値がnullでないならば、currentIndexは増加しません。

source: If the value passed as source is greater than the maximum representable value in this type, the result is the type’s max value.
ja: sourceとして渡された値がこの型において最大限の表現可能な値より大きいならば、結果はこの型のもつmax値です。

source: If the value passed as source is not representable exactly, the result is nil.
ja: sourceとして渡された値が正確に表現可能でないならば、結果はnilです。

source: If there aren’t any pending tasks in the task group, this method returns nil, which lets you write like the following to wait for a single task to complete:
ja: 何ら未解決タスクがタスクグループの中にないならば、このメソッドはnilを返します、それはあなたにある単一のタスクが完了するのを待つために以下のように書かせます：

source: If there aren’t any pending tasks in the task group, this method returns nil, which lets you write the following to wait for a single task to complete:
ja: 何ら未解決タスクがタスクグループの中にないならば、このメソッドはnilを返します、それはあなたにある単一のタスクが完了するのを待つ以下を書かせます：

source: If there is no value of the type that corresponds with the specified raw value, this initializer returns nil.
ja: 指定された生の値に対応する型の値が１つもないならば、このイニシャライザはnilを返します。

source: If this index does not have an exact corresponding position in characters, this method returns nil.
ja: このインデックスがまさにその対応する位置をcharactersにおいて持たないならば、イニシャライザの結果はnilです。

source: If this index does not have an exact corresponding position in utf16, this method returns nil.
ja: このインデックスがまさにその対応する位置をutf16において持たないならば、イニシャライザの結果はnilです。

source: If this index does not have an exact corresponding position in utf8, this method returns nil.
ja: このインデックスがまさにその対応する位置をutf8において持たないならば、イニシャライザの結果はnilです。

source: If this index does not have an exact corresponding position in unicodeScalars, this method returns nil.
ja: このインデックスがまさにその対応する位置をunicodeScalarsにおいて持たないならば、イニシャライザの結果はnilです。

source: If this mutates the string, it will invalidate any pre-existing indices.
ja: これが文字列を変化させるならば、それはあらゆる前から存在するインデックスを無効にするでしょう。

source: If this mutates the substring, it will invalidate any pre-existing indices.
ja: これが下位文字列を変化させるならば、それはあらゆる前から存在するインデックスを無効にするでしょう。

source: If this string is not contiguous, make it so.
ja: この文字列が隣接しないならば、それをそうします。

source: If this string is not contiguous, this will first make it contiguous, which will also speed up subsequent access.
ja: この文字列が隣接しないならば、これは最初にそれを隣接させます、それはまた後に続くアクセスの速度を上げるでしょう。

source: If this substring is not contiguous, this will first make it contiguous, which will also speed up subsequent access.
ja: この下位文字列が隣接しないならば、これは最初にそれを隣接させます、それはまた後に続くアクセスの速度を上げるでしょう。

source: If this task is the highest-priority task in the system, the executor immediately resumes execution of the same task.
ja: このタスクがシステムにおいて最も高い優先度のタスクであるならば、エグセキュータは直ぐに同じタスクの遂行を再開します。

source: If this type has value semantics, the PlaygroundQuickLook instance should be unaffected by subsequent mutations.
ja: この型が値意味論を持つならば、PlaygroundQuickLookはその後の変化によって影響を受けないべきです。

source: If this type has value semantics, the mirror should be unaffected by subsequent mutations of the instance.
ja: この型が値意味論を持つならば、ミラーはインスタンスのその後の変化によって影響を受けないべきです。

source: If this type’s Stride type conforms to BinaryInteger, then for a value x, a distance n, and a value y = x.advanced(by: n), x.distance(to: y) == n.
ja: この型のもつStride型がBinaryIntegerに準拠するならば、そのとき値x、隔たりn、そして値y = x.advanced(by: n)に対して、x.distance(to: y) == n。

source: If this type’s Stride type conforms to BinaryInteger, then for two values x and y, and a distance n = x.distance(to: y), x.advanced(by: n) == y.
ja: この型のもつStride型がBinaryIntegerに準拠するならば、そのとき２つの値xとy、そして隔たりn = x.distance(to: y)に対して、x.advanced(by: n) == y。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison instead.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、代わりにString APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、String APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are using the memory for a specific type, allocate memory using the UnsafeMutablePointer.allocate(capacity:) static method instead.
ja: あなたがメモリを特定の型に対して使っているならば、メモリを代わりにUnsafeMutablePointer.allocate(capacity:)静的メソッドを使ってアロケートしてください。

source: If you are using the memory for a specific type, allocate memory using the UnsafeMutablePointerBuffer.allocate(capacity:) static method instead.
ja: あなたが特定の型のためのメモリを使っているならば、代わりにメモリをUnsafeMutablePointerBuffer.allocate(capacity:)静的メソッドを使ってアロケートしてください。

source: If you declare a new operator without specifying a precedence group, it is a member of the DefaultPrecedence precedence group.
ja: あなたが新しい演算子を優先順位グループを指定せずに宣言するならば、それはDefaultPrecedence優先順位グループのメンバです。

source: If you do need to access memory that is bound to one type as a different type, Swift’s pointer types provide type-safe ways to temporarily or permanently change the bound type of the memory, or to load typed instances directly from raw memory.
ja: あなたがある型に束縛されるメモリに異なる型としてアクセスする必要があるならば、Swiftのポインタ型は型安全な方法を提供することで、一時的にまたは永続的にメモリの束縛される型を変更します、または型付インスタンスを直接に生のメモリからロードします。

source: If you mutate the collection while iterating over its indices, a strong reference can cause an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期されない複製の原因となります。

source: If you mutate the collection while iterating over its indices, a strong reference can result in an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期しない複製という結果になります。

source: If you need a reversed collection of the same type, you may be able to use the collection’s sequence-based or collection-based initializer.
ja: あなたが同じ型での逆にされたコレクションを必要とするならば、あなたはコレクションのもつシーケンス基盤のまたはコレクション基盤のイニシャライザを使うことができるでしょう。

source: If you need an integer value within a specific range, use the static random(in:using:) method on that integer type instead of this method.
ja: あなたがある整数を指定範囲内で必要とするならば、静的random(in:using:)メソッドをその整数型の上で使ってください、このメソッドの代わりに。

source: If you need to access a specific position in a UTF-16 view, use Swift’s index manipulation methods.
ja: あなたがUTF-16ビューにおいて特定の位置にアクセスする必要があるならば、Swiftのインデックス操作メソッドを使ってください。

source: If you need to access the contents of a string as encoded in different Unicode encodings, use one of the string’s unicodeScalars, utf16, or utf8 properties.
ja: あなたがある文字列の内容に異なるユニコードエンコーディングでエンコードされたようにアクセスする必要があるならば、その文字列のもつunicodeScalars、utf16、またはutf8プロパティの１つを使ってください。

source: If you need to disambiguate between overloaded functions, use parenthesized expressions along with the as operator to make the #selector expression refer unambiguously to a specific overload.
ja: あなたがオーバーロードされた関数の間の違いを明らかにする必要があるならば、括弧に囲まれた式をas演算子と一緒に使って、#selector式を明白に特定のオーバーロードを参照するようにしてください。

source: If you need to infer moves, call the inferringMoves() method on the resulting difference.
ja: あなたが移動の推論を必要とするならば、inferringMoves()メソッドを結果の差異の上で呼び出してください。

source: If you need to store a copy of a nontrivial value into memory, or to store a value into memory that contains a nontrivial value, you cannot use the storeBytes(of:toByteOffset:as:) method.
ja: あなたが非自明の値のコピーをメモリに格納する、またはある値を非自明の値を含むメモリに格納する必要がある場合、あなたはstoreBytes(of:toByteOffset:as:)メソッドを使うことはできません。

source: If you need to validate that an index from one string’s view corresponds with an exact position in another view, use the index’s samePosition(in:) method or the init(_:within:) initializer.
ja: あなたがある文字列の持つビューからのインデックスが別のビューでの正確な位置と対応することを有効にする必要があるならば、そのインデックスのsamePosition(in:)メソッドまたはinit(_:within:)イニシャライザを使ってください。

source: If you only need to throw an error to stop the work, call the Task.checkCancellation() function to check for cancellation.
ja: あなたはあるエラーをスローしてその仕事を止める必要があるだけならば、Task.checkCancellation()関数を呼び出して取り消しを調べてください。

source: If you pass a zero-length range as the subrange parameter, this method inserts the elements of newElements at subrange.startIndex.
ja: あなたがゼロ長範囲をsubrangeパラメータとして渡すならば、このメソッドはnewElementsの要素をsubrange.startIndexで挿入します。

source: If you pass the collection’s endIndex property as the index parameter, the new element is appended to the collection.
ja: あなたがコレクションのendIndexプロパティをindexパラメータとして渡すならば、新しい要素がコレクションに追加されます。

source: If you pass the collection’s endIndex property as the index parameter, the new elements are appended to the collection.
ja: あなたがコレクションのendIndexプロパティをindexパラメータとして渡すならば、いくらかの新しい要素がコレクションに追加されます。

source: If you provide your own implementation, make sure to compute the value nondestructively.
ja: あなたがあなた独自の実装を提供するならば、値を非破壊的に計算することを確実にしてください。

source: If you use 11 as rhs, x is overshifted such that all of its bits are set to zero.
ja: あなたが11をrhsとして使うならば、xは、それのビットのすべてがゼロに設定されるような、オーバーシフトをされます。

source: If you use 2 as the right-hand-side value in an operation on x, the shift amount requires no masking.
ja: あなたが2を右手側の値としてxに関する演算において使うならば、シフト量はマスクを必要としません。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted left by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ左にシフトされます。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted right by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ右にシフトされます。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow addition operator (&+).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー加算演算子（&+）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow multiplication operator (&*).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー乗算演算子（&*）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow subtraction operator (&-).
ja: あなたがオーバーフロー検査を取りやめてあらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー減算演算子（&-）を使ってください。

source: If you will be adding a known number of elements to a collection, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素をコレクションに加えることになっているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you’re passing a generator that results in the same sequence of elements each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ要素からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same sequence of integer values each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ整数値からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same shuffled order each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じシャッフルされた順番という結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re working directly with numeric values, use the addition operator (+) instead of this method.
ja: あなたが直接に数値を扱っているならば、加算演算子（+）をこのメソッドの代わりに使ってください。

source: Ill-formed sequences are replaced with the Unicode replacement character ("\u{FFFD}").
ja: 誤形式シーケンスは、ユニコード代替文字（"\u{FFFD}"）で置き換えられます。

source: Implement this method to conform to the Hashable protocol.
ja: このメソッドを実装して、Hashableプロトコルに準拠してください。

source: Implicit Casting and Bridging
ja: 暗黙的なキャストとブリッジ

source: Important
ja: 重要

source: Imported C and Objective-C APIs
ja: インポートされたCおよびObjective-C API

source: Improve your app’s performance by refactoring your code to take advantage of asynchronous functions in Swift.
ja: Swiftでの並行性関数を利用するようにあなたのコードをリファクタリングすることであなたのアプリの性能を改良してください。

source: In Objective-C, a key is a string that identifies a specific property of an object.
ja: Objective-Cでは、キーはオブジェクトの特定のプロパティを識別する文字列です。

source: In Objective-C, a selector is a type that refers to the name of an Objective-C method.
ja: Ojbective-Cでは、セレクタはObjective-Cメソッドの名前を参照するある型です。

source: In SDKs that support Swift concurrency, frameworks add async-await versions of most functions that previously took completion handlers.
ja: Swift並行性をサポートするSDKにおいて、フレームワークそれらは以前に完了ハンドラをとっていた大部分の関数のasync-awaitバージョンを加えます。

source: In Swift, reachability refers to the ability to produce one value from the other through zero or more applications of index(after:).
ja: Swiftでは、到達可能性 reachabilityは、ゼロ以上のindex(after:)の適用を通して、ある値を別のものから生み出す能力のことを言います。

source: In Swift, Objective-C selectors are represented by the Selector structure, and you create them using the #selector expression.
ja: Swiftでは、Objective-CセレクタはSelector構造体によって表されます、そしてあなたはそれらを#selector式を使って作成します。

source: In Swift, you create a selector for an Objective-C method by placing the name of the method within the #selector expression: #selector(MyViewController.tappedButton(_:)).
ja: Swiftでは、あなたはセレクタをObjective-Cメソッドに対して、そのメソッドの名前を#selector式の内部に置くことによって作成します：#selector(MyViewController.tappedButton(_:))。

source: In Swift, you use the #selector and #keyPath expressions to represent those method or property names as selectors or key paths, respectively.
ja: Swiftでは、あなたは#selectorと#keyPath式を使って、それらメソッドまたはプロパティ名をセレクタまたはキーパスとして表します。

source: In a Zip2Sequence instance, the elements of the ith pair are the ith elements of each underlying sequence.
ja: Zip2Sequenceインスタンスにおいて、i番目の対に属する要素らは、基盤となるシーケンスそれぞれのi番目の要素です。

source: In a collection, the subsequence should also conform to Collection.
ja: あるコレクションにおいて、下位シーケンスはまたCollectionに準拠すべきです。

source: In a long-task that includes multiple pieces, you might need to check for cancellation at several points, and handle cancellation differently at each point.
ja: 複数の断片を含む長いタスクにおいて、あなたは取り消しをいくつかの地点で調べる、そして取り消しを各地点で異なって取り扱う必要があるかもしれません。

source: In addition to checking whether the base scalar has isEmoji == true, you must also check its default presentation (see isEmojiPresentation) and determine whether it is followed by a variation selector that would modify the presentation.
ja: 基底スカラーがisEmoji == trueであるかどうかを調べることに加えて、あなたはまたそれの省略時の表現を調べて（isEmojiPresentationを見てください）そしてその表現を修正する異字体セレクタがそれの後に続くかどうかを判定しなければなりません。

source: In addition to creating a string from a single string literal, you can also create an empty string, a string containing an existing group of characters, or a string repeating the contents of another string.
ja: 単独の文字列リテラルから文字列を作成することに加えて、あなたはまた、空の文字列、既存のいくつかの文字からなるグループを含んでいる文字列、または別の文字列の内容を繰り返している文字列を作成できます。

source: In addition to its collection interface, an UnsafeMutableRawBufferPointer instance also supports the following methods provided by UnsafeMutableRawPointer, including bounds checks in debug mode:
ja: それのコレクションインターフェイスに加えて、UnsafeMutableRawBufferPointerインスタンスはまた、UnsafeMutableRawPointerによって提供される以下のメソッドをサポートし、デバッグモードにおける境界検査を含んでいます。

source: In addition to its collection interface, an UnsafeRawBufferPointer instance also supports the load(fromByteOffset:as:) method provided by UnsafeRawPointer, including bounds checks in debug mode.
ja: それのコレクションインターフェイスに加えて、UnsafeRawBufferPointerインスタンスはまた、load(fromByteOffset:as:)メソッドをUnsafeRawPointerによって提供されてサポートし、デバッグモードにおける境界検査を含んでいます。

source: In addition, because abs(_:) always returns a value of the same type, even in a generic context, using the function instead of the magnitude property is encouraged.
ja: 加えて、abs(_:)は常に同じ型の値を返すことから、総称体の文脈においてさえも、この関数をmagnitudeプロパティの代わりに使うことは推奨されます。

source: In an empty UTF-16 view, endIndex is equal to startIndex.
ja: 空のUTF-16ビューにおいて、endIndexはstartIndexと等しいです。

source: In an empty UTF-8 view, endIndex is equal to startIndex.
ja: 空のUTF-8ビューにおいて、endIndexはstartIndexと等しいです。

source: In an empty Unicode scalars view, endIndex is equal to startIndex.
ja: 空のユニコードスカラービューにおいて、endIndexはstartIndexと等しいです。

source: In an empty string, endIndex is equal to startIndex.
ja: 文字列が空ならば、endIndexはstartIndexと等しいです。

source: In an empty string, startIndex is equal to endIndex.
ja: 空の文字列において、endIndexはstartIndexと等しいです。

source: In case of an invalid input value, nil is returned.
ja: 無効な入力値の場合には、nilが返されます。

source: In case of an invalid input value, the result is nil.
ja: 無効な入力値の場合には、結果はnilです。

source: In case of an invalid unicode scalar value, nil is returned.
ja: 無効なユニコードスカラー値の場合には、nilが返されます。

source: In fact, s.flatMap(transform) is equivalent to Array(s.map(transform).joined()).
ja: 実際のところ、s.flatMap(transform)はArray(s.map(transform).joined())に等しいです。

source: In most cases, the Swift type system prevents a task group from escaping like that because adding a child task is a mutating operation, and mutation operations can’t be performed from concurrent execution contexts likes child tasks.
ja: ほとんどの場合、Swift型システムはタスクグループがそのような脱出をするのを妨げます、なぜなら子タスクを加えることは可変演算だからです、そして可変演算は子タスクのような並列実行文脈から実行されることができません。

source: In most cases, the Swift type system prevents this mistake; for example, because the add(priority:operation:) method is mutating, that method can’t be called from a concurrent execution context like a child task.
ja: ほとんどの場合には、Swift型システムはこの誤りを防ぎます；例えば、add(priority:operation:)メソッドが変化することから、そのメソッドは子タスクのような並行性遂行文脈から呼び出されることができません。

source: In order to use recursion without making copies of the strings at each step, countLetterChanges(_:_:) uses Substring, a string’s slice type, for its parameters.
ja: 各段階で文字列のコピーを作ることなく反復を使う手段として、countLetterChanges(_:_:)はSubstring、文字列の持つスライス型、をそれのパラメータに対して使います。

source: In particular, because cafe was declared using the decomposed form of the "é" character, unicodeScalars contains the scalar values for both the letter "e" (101) and the accent character "´" (769).
ja: とりわけ、cafeは分解形式の"é"文字を使って宣言されたことから、unicodeScalarsは字"e"（101）とアクセント文字"´"（769）両方のスカラー値を含みます。

source: In particular, do not use implicit bridging when calling an UnsafeMutablePointer initializer.
ja: とりわけ、暗黙的ブリッジをUnsafeMutablePointerイニシャライザを呼ぶ時に使わないでください。

source: In particular, do not use implicit bridging when calling an UnsafeMutableRawPointer initializer.
ja: とりわけ、暗黙的ブリッジをUnsafeMutableRawPointerイニシャライザを呼ぶ時に使わないでください。

source: In particular, do not use implicit bridging when calling an UnsafePointer initializer.
ja: とりわけ、暗黙的ブリッジをUnsafePointerイニシャライザを呼ぶ時に使わないでください。

source: In particular, do not use implicit bridging when calling an UnsafeRawPointer initializer.
ja: とりわけ、暗黙的ブリッジをUnsafeRawPointerイニシャライザを呼ぶ時に使わないでください。

source: In particular, this discussion mentions extended grapheme clusters, Unicode scalar values, and canonical equivalence.
ja: とりわけ、この解説は拡張書記素クラスタ、ユニコードスカラー値、そして正準等価について言及します。

source: In simple cases, you can use DefaultStringInterpolation as the interpolation type for types that conform to the ExpressibleByStringLiteral protocol.
ja: 単純な場合には、あなたはDefaultStringInterpolationを補間型としてExpressibleByStringLiteralプロトコルに準拠する型に対して使用できます。

source: In some cases an SDK call requires using a completion handler.
ja: いくつかの場合においてSDKは完了ハンドラを使うことを要求します。

source: In some situations the priority of a task must be elevated (or “escalated”, “raised”):
ja: いくつかの状況ではタスクの優先度は昇進させられる必要があります（または “段階的に上昇”、“そこまで高める”）：

source: In that case, a string’s unicodeScalars view contains more elements than the string itself.
ja: その場合には、文字列のもつunicodeScalarsビューは、その文字列それ自体より多くの要素を含みます。

source: In that case, the method returns nil.
ja: その場合には、このメソッドはnilを返します。

source: In the case of secondCodeUnit, that character is still the flag itself.
ja: secondCodeUnitの場合では、その文字は依然として旗それ自体です。

source: In the encoded representation of a Unicode scalar value, each UTF-8 code unit after the first is called a continuation byte.
ja: あるユニコードスカラー値の符号化された表現において、最初のものの後の各UTF-8コード単位は、継続バイトと呼ばれます。

source: In the example above, moreNumbers has the same type as numbers, which is [Int].
ja: 上の例において、moreNumbersはnumbersと同じ型を持ちます、それは[Int]です。

source: In the following example, ptr is a pointer to memory initialized with a value of 23:
ja: 以下の例において、ptrは23の値で初期化されるメモリに対するポインタです。

source: In the following example, an array of numbers is partitioned by a predicate that matches elements greater than 30.
ja: 次の例において、数からなる配列は、30より大きな要素に合致するという述部によって仕切られます。

source: In the following example, the closure provides an ordering for an array of a custom enumeration that describes an HTTP response.
ja: 以下の例では、そのクロージャは、あるHTTP応答を記述するあつらえ列挙の配列に対してある順序付けを提供します。

source: In the following example, the constant y is successfully created from x, an Int instance with a value of 100.
ja: 以下の例において、定数yは、Intインスタンスで100の値を持つxからうまく作成されます

source: In the following example, the constant x is successfully created from a value of 100, while the attempt to initialize the constant y from 1_000 fails because the Int8 type can represent 127 at maximum:
ja: 以下の例において、定数xは100の値から首尾よく作り上げられます、一方で定数yを1_000から初期化する試みは失敗します、なぜならInt8型は最大で127を表現可能だからです：

source: In the following example, the constant x is successfully created from a value of 21.0, while the attempt to initialize the constant y from 21.5 fails:
ja: 続く例において、定数xは21.0の値から首尾よく作成されます、一方で定数yを21.5から初期化する試みは失敗します：

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the difference of 10 and 21 is less than zero, the minimum representable UInt value, so the result is the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と21の差はゼロ、最小限表現可能なUInt値、よりも少ないです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the predicate provides an ordering for an array of a custom HTTPResponse type.
ja: 以下の例では、その述部はあつらえのHTTPResponse型の配列に対してある順序付けを提供します。
